Revit 2027 API
MEPSystemType.SystemClassification Property
 Identifies the classification for the system type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPSystemClassification SystemClassification { get; }
Public ReadOnly Property SystemClassification As MEPSystemClassification
	Get
public:
property MEPSystemClassification SystemClassification {
	MEPSystemClassification get ();
}
member SystemClassification : MEPSystemClassification with get
Property Value
MEPSystemClassification
Remarks
 The system classification drives certain behavior such as sizing and connections to other systems
See Also
Reference
MEPSystemType Class
Autodesk.Revit.DB Namespace